<?php

/**
 * @author Yana Bielik
 */

namespace Library;

trait Questionnaire
{
    public $questions = [
        'punctuality' => [
            'title' => 'Пунктуальність',
            'type' => 'range',
            'hints' => [
                '1' => 'Заняття скасовували без пояснень та відпрацювань або викладач систематично запізнюється на 15+ хвилин',
                '5' => 'Заняття проводились відповідно до розкладу'
            ]
        ],
        'objectivity' => [
            'title' => "Об'єктивність оцінювання",
            'type' => 'range',
            'description' => "Об'єктивність оцінювання передбачає виставлення балів лише за індивідуальні знання предмету. Викладач повинен оцінювати за заздалегідь встановленими критеріями, незалежно від інших студентів.",
            'hints' => [
                '1' => "Викладач оцінює необ'єктивно (як на користь студента, так і ні)",
                '5' => "Викладач оцінює об'єктивно"
            ]
        ],
        'politeness' => [
            'title' => 'Ввічливість',
            'type' => 'range',
            'description' => 'Коректність викладача, етика спілкування',
            'hints' => [
                '1' => 'Кричить/принижує честь та гідність студентів/проявляє сексизм тощо',
                '5' => 'Ввічливий, спокійний, доброзичливий'
            ]
        ],
        'relevance' => [
            'title' => 'Актуальність матеріалу',
            'type' => 'range',
            'description' => 'Оцінюйте лекційний матеріал, а не дисципліну, навіть якщо вона вам здається не потрібною. Матеріал є актуальним, якщо він використовується в сучасній практиці у дисципліні, яку веде викладач.',
            'hints' => [
                '1' => 'Матеріал неактуальний',
                '5' => 'Матеріал актуальний'
            ]
        ],
        'exams' => [
            'title' => 'Надання питань до заліку',
            'type' => 'range',
            'description' => 'Наявність переліку теоретичних питань, що будуть на заліку/екзамені.',
            'hints' => [
                '1' => 'Перелік не наданий або наданий занадто пізно для підготовки/"Буде те, що проходили"',
                '5' => 'Перелік наданий вчасно/проблем з нестачею часу на підготовку не виникло'
            ]
        ],
        'lecture' => [
            'title' => 'Організація лекційного часу',
            'type' => 'range',
            'hints' => [
                '1' => 'Забагато часу витрачається на сторонні теми/Лектор не володіє матеріалом або читає з папірця/Лекцій немає',
                '5' => 'Лекції інформативні, не містять "води"'
            ]
        ],
        'practice' => [
            'title' => 'Організація часу на занятті',
            'type' => 'range',
            'hints' => [
                '1' => 'Забагато часу витрачається на сторонні теми/Викладач не встигає оцінити роботи/Занять немає',
                '5' => 'Втрати часу на сторонні теми мінімальні, викладач спроможний працювати з кожним студентом'
            ]
        ],
        'conformity' => [
            'title' => 'Відповідність практик лекціям',
            'type' => 'range',
            'hints' => [
                '1' => 'Завдання не відповідають матеріалу взагалі',
                '5' => 'Завдання повністю відповідають пройденому матеріалу'
            ]
        ],
        'knowledge' => [
            'title' => 'Самооцінка власних знань, після проходження курсу',
            'type' => 'range',
            'hints' => [
                '1' => 'Я не отримав жодних актуальних та змістовних знань з даної дисципліни',
                '5' => 'Я отримав актуальні та змістовні знання з даної дисципліни'
            ]
        ],
        'evaluation' => [
            'title' => 'Вважають, що предмет не можна закрити без знань',
            'type' => 'closed',
            'description' => 'Викладач систематично оцінює таким чином, що бали можна набрати без фактичних знань'
        ],
        'distance' => [
            'title' => 'Задоволеність організацією дистанційного навчання?',
            'type' => 'closed'
        ],
        'main' => [
            'title' => 'Вважають, що університету варто продовжувати контракт цьому викладачу',
            'type' => 'closed'
        ]
    ];
    
    public function __construct(){
    }
}